In [2]:
import pandas as pd

In [4]:
data = pd.read_clipboard()
data

        Name Nationality     Sex  Age Handedness
0      Kathy         USA  Female   23      Right
1      Linda         USA  Female   18      Right
2      Peter         USA    Male   19      Right
3       John         USA    Male   22       Left
4     Fatima    Pakistan  Female   31       Left
5      Kadir    Pakistan    Male   25       Left
6      Simon          UK    Male   35       Left
7    Rebecca          UK  Female   31       Left
8   Jonathan          UK    Male   37      Right
9        Yan       China  Female   52      Right
10      Juan       China  Female   58       Left
11     Liang       China    Male   43       Left

In [5]:
# for crosstab first specify what you want on X-axis i.e. index and then on Y-axis i.e. column
# cross tab is used to show the frequency distribution of various variables
pd.crosstab(data.Nationality, data.Handedness)

Handedness   Left  Right
Nationality
China           2      1
Pakistan        2      0
UK              2      1
USA             1      3

In [6]:
# to generate the total you can provide margins argumnet
pd.crosstab(data.Sex, data.Nationality, margins= True)

Nationality  China  Pakistan  UK  USA  All
Sex
Female           2         1   1    2    6
Male             1         1   2    2    6
All              3         2   3    4   12

In [7]:
pd.crosstab( data.Nationality,data.Sex, margins= True)

Sex          Female  Male  All
Nationality
China             2     1    3
Pakistan          1     1    2
UK                1     2    3
USA               2     2    4
All               6     6   12

In [8]:
 pd.crosstab([data.Nationality, data.Sex], data.Handedness)

Handedness          Left  Right
Nationality Sex
China       Female     1      1
            Male       1      0
Pakistan    Female     1      0
            Male       1      0
UK          Female     1      0
            Male       1      1
USA         Female     0      2
            Male       1      1

In [9]:
pd.crosstab(data.Nationality, [data.Sex, data.Handedness], margins= True)

Sex         Female       Male       All
Handedness    Left Right Left Right
Nationality
China            1     1    1     0   3
Pakistan         1     0    1     0   2
UK               1     0    1     1   3
USA              0     2    1     1   4
All              3     3    4     2  12

In [10]:
pd.crosstab(data.Nationality, data.Handedness, margins = True)

Handedness   Left  Right  All
Nationality
China           2      1    3
Pakistan        2      0    2
UK              2      1    3
USA             1      3    4
All             7      5   12

In [11]:
pd.crosstab(data.Nationality, data.Handedness, normalize='index')

Handedness       Left     Right
Nationality
China        0.666667  0.333333
Pakistan     1.000000  0.000000
UK           0.666667  0.333333
USA          0.250000  0.750000

In [13]:
import numpy as np
pd.crosstab(data.Sex, data.Handedness, values = data.Age, aggfunc= np.average, margins = True)

Handedness   Left  Right        All
Sex
Female      40.00   31.0  35.500000
Male        31.25   28.0  30.166667
All         35.00   29.8  32.833333

#### pivot and pivot table

In [16]:
df = pd.read_clipboard()
df

    date      city  temperature  humidity
0  42740  new york           65        56
1  42771  new york           66        58
2  42799  new york           68        60
3  42740   karachi           75        80
4  42771   karachi           78        83
5  42799   karachi           82        85
6  42740   beijing           80        26
7  42771   beijing           77        30
8  42799   beijing           79        35

In [17]:
df.pivot(index = 'city', columns = 'date')

         temperature             humidity
date           42740 42771 42799    42740 42771 42799
city
beijing           80    77    79       26    30    35
karachi           75    78    82       80    83    85
new york          65    66    68       56    58    60

In [18]:
df.pivot(index = 'city', columns = 'date', values = 'humidity')

date      42740  42771  42799
city
beijing      26     30     35
karachi      80     83     85
new york     56     58     60

### Pivot Table

In [19]:
df = pd.read_clipboard()
df

    date      city  temperature  humidity
0  42740  new york           65        56
1  42740  new york           61        54
2  42771  new york           70        60
3  42771  new york           72        62
4  42740   karachi           75        80
5  42740   karachi           78        83
6  42771   karachi           82        85
7  42771   karachi           80        26

In [20]:
# default aggregate function is mean
df.pivot_table(index = 'city', columns = 'date')

         humidity       temperature
date        42740 42771       42740 42771
city
karachi      81.5  55.5        76.5  81.0
new york     55.0  61.0        63.0  71.0

In [21]:
# we can use various functions not only from pandas but also from numpy like count
df.pivot_table(index = 'city', columns = 'date', aggfunc = 'sum')

         humidity       temperature
date        42740 42771       42740 42771
city
karachi       163   111         153   162
new york      110   122         126   142

In [22]:
df.pivot_table(index = 'city', columns = 'date', margins = True)

         humidity               temperature
date        42740  42771    All       42740 42771     All
city
karachi     81.50  55.50  68.50       76.50  81.0  78.750
new york    55.00  61.00  58.00       63.00  71.0  67.000
All         68.25  58.25  63.25       69.75  76.0  72.875

### grouper

In [39]:
df = pd.read_clipboard()
df

         Date   Close    Volume Symbol
0  03/10/2016   31.50  14070500   CSCO
1  03/10/2016  112.52  21701800   AAPL
2  03/10/2016   57.42  19189500   MSFT
3  04/10/2016  113.00  29736800   AAPL
4  04/10/2016   57.24  20085900   MSFT
5  04/10/2016   31.35  18460400   CSCO
6  05/10/2016   57.64  16726400   MSFT
7  05/10/2016   31.59  11808600   CSCO
8  05/10/2016  113.05  21453100   AAPL

In [40]:
df['Date'] = pd.to_datetime(df['Date'])

In [41]:
df

        Date   Close    Volume Symbol
0 2016-03-10   31.50  14070500   CSCO
1 2016-03-10  112.52  21701800   AAPL
2 2016-03-10   57.42  19189500   MSFT
3 2016-04-10  113.00  29736800   AAPL
4 2016-04-10   57.24  20085900   MSFT
5 2016-04-10   31.35  18460400   CSCO
6 2016-05-10   57.64  16726400   MSFT
7 2016-05-10   31.59  11808600   CSCO
8 2016-05-10  113.05  21453100   AAPL

In [43]:
type(df.Date[0])

pandas._libs.tslibs.timestamps.Timestamp

In [44]:
df.pivot_table(index = pd.Grouper(freq = 'M', key = 'Date'), columns = 'Symbol')

             Close                  Volume
Symbol        AAPL   CSCO   MSFT      AAPL      CSCO      MSFT
Date
2016-03-31  112.52  31.50  57.42  21701800  14070500  19189500
2016-04-30  113.00  31.35  57.24  29736800  18460400  20085900
2016-05-31  113.05  31.59  57.64  21453100  11808600  16726400

In [33]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [35]:
ufo.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
dtype: object

In [36]:
ufo.tail()

              City Colors Reported Shape Reported State              Time
18236   Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237  Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238  Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239  Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240         Ybor             NaN           OVAL    FL  12/31/2000 23:59

In [37]:
ufo['Time'] = pd.to_datetime(ufo['Time'])

In [38]:
ufo.dtypes

City                       object
Colors Reported            object
Shape Reported             object
State                      object
Time               datetime64[ns]
dtype: object